RIET/src/Reports/FAListAsOfDateProfitTax/FAListAsOfDateProfitTax.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>FAListAsOfDateProfitTax</name>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтрицательноеКрасным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияНастроекПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПараметрыПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементаОтчета</name>
    <type>
      <types>EnumRef.ПредставленияЭлементовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровки</name>
  </attributes>
</mdclass:Report>

RIET/src/Catalogs/ОсновныеСредстваLawson/ОсновныеСредстваLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредстваLawson</name>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CompanyLawson</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>AstAccountLawson</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>DeprAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеремещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AssetType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SubType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PoNbr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LocationLawson</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierNumberLawson</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Invoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Deferred</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОСФискал</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Reports/FAListAsOfDateProfitTax/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//ТаблицаНабораДанных = Новый ТаблицаЗначений;
	ТаблицаНабораДанных = ВернутьТаблицу();
	
	//Связь между таблицей значений и именами в СКД 
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаНабораДанных", ТаблицаНабораДанных);

	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);

	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	//Вывод результата 
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ВернутьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеСредстваLawsonОСФискал.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредстваLawsonОСФискал.Ссылка.Код КАК ОСLawsonКод
		|ИЗ
		|	Справочник.ОсновныеСредстваLawson.ОСФискал КАК ОсновныеСредстваLawsonОСФискал
		|ИТОГИ ПО
		|	ОсновноеСредство";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОсновноеСредство = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТЗ.Колонки.Добавить("ОСLawsonКод", Новый ОписаниеТипов("Строка"));
	Пока ВыборкаОсновноеСредство.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.ОсновноеСредство = ВыборкаОсновноеСредство.ОсновноеСредство;
		ВыборкаДетальныеЗаписи = ВыборкаОсновноеСредство.Выбрать();
	    ОСLawsonКод = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОСLawsonКод = ОСLawsonКод + ВыборкаДетальныеЗаписи.ОСLawsonКод + ", ";
		КонецЦикла;
		Если Прав(ОСLawsonКод,2) = ", " Тогда
		    ОСLawsonКод = Лев(ОСLawsonКод, СтрДлина(ОСLawsonКод) - 2);
		КонецЕсли; 
		НоваяСтрока.ОСLawsonКод = ОСLawsonКод; 
		
	КонецЦикла;
	Возврат ТЗ;
	
КонецФункции
